Autodesk.Revit.UI.UIThemeManager.GetCurrentFrameBackgroundColor
Returns the frame background color from the given theme.
Since:
2014

Autodesk.Revit.UI.UIThemeManager.GetThemeName(Autodesk.Revit.UI.UITheme)
Gets the theme name for the given theme type.
frameTheme:
The theme.
Returns:
The name of the theme.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2024